AVSystem/Anjay-type1se/Drivers/BSP/B-L462E-CELL1/stm32l462e_cell1_qspi_onboard.c
/**
  ******************************************************************************
  * @file    stm32l462e_cell1_qspi_onboard.c
  * @author  MCD Application Team
  * @brief   This file includes a standard driver for the MT25QU512ABB QSPI
  *          flash memory mounted on STM32L462E_CELL1 board.
  * @note    Two QSPI modules are mounted on the board, they are exclusive.
  *          The MT25QU512ABB is know as "onboard QSPI" and is not active by default.
  *          It is activated when:
  *           - SB28 is ON
  *           - SB43 is OFF
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2019-2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32l462e_cell1_qspi_onboard.h"
#include "stm32l462e_cell1_qspi.h"

#if (USE_HAL_QSPI_REGISTER_CALLBACKS == 0)
#include "quadspi.h"
#endif /* (USE_HAL_QSPI_REGISTER_CALLBACKS == 0) */

/** @addtogroup BSP BSP
  * @{
  */

/** @addtogroup STM32L462E_CELL1 STM32L462E_CELL1
  * @{
  */

/** @addtogroup STM32L462E_CELL1_QSPI_ONBOARD STM32L462E_CELL1 QSPI_ONBOARD
  * @{
  */

/** @defgroup STM32L462E_CELL1_QSPI_ONBOARD_Private_Private_Variables
  *              STM32L462E_CELL1 QSPI_ONBOARD Private Variables
  * @{
  */
/* default QSPI configuration for this board */
static QSPI_Ctx_t QSPICtx =
{
  .IsInitialized = BSP_QSPI_ACCESS_NONE,
  .InterfaceMode = BSP_QSPI_QPI_MODE,
  .TransferRate = BSP_QSPI_DTR_TRANSFER,
  .DualFlashMode = BSP_QSPI_DUALFLASH_DISABLE,
};
/**
  * @}
  */

/** @defgroup STM32L462E_CELL1_QSPI_ONBOARD_Private_Functions_Prototypes
  *              STM32L462E_CELL1 QSPI_ONBOARD Functions Prototypes
  * @{
  */
static int32_t QSPI_CheckID(void);
static int32_t QSPI_ResetMemory(void);
static int32_t QSPI_SetODS(void);
static int32_t QSPI_EnterDPIMode(void);
static int32_t QSPI_ExitDPIMode(void);
static int32_t QSPI_ConfigFlash(BSP_QSPI_Interface_t Mode, BSP_QSPI_Transfer_t Rate);

static MT25QL512ABB_Interface_t convert_InterfaceMode(BSP_QSPI_Interface_t inMode);
static MT25QL512ABB_DualFlash_t convert_DualFlashMode(BSP_QSPI_DualFlash_t inMode);
static MT25QL512ABB_Erase_t convert_EraseBlockSize(BSP_QSPI_Erase_t inSize);
/**
  * @}
  */

/** @defgroup STM32L462E_CELL1_QSPI_ONBOARD_Exported_Functions STM32L462E_CELL1 QSPI_ONBOARD Exported Functions
  * @{
  */

/**
  * @brief  Initializes the QSPI interface.
  * @retval BSP status
  */
int32_t BSP_QSPI_Init(void)
{
  int32_t ret;
  MT25QL512ABB_Info_t pInfo;
  uint32_t qspi_flashSize;

  /* Check if instance is already initialized */
  if (QSPICtx.IsInitialized == BSP_QSPI_ACCESS_NONE)
  {
#if (USE_HAL_QSPI_REGISTER_CALLBACKS == 1)
    /* Register the QSPI MSP Callbacks */
    if (BSP_QSPI_RegisterDefaultMspCallbacks() != BSP_ERROR_NONE)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
#endif /* USE_HAL_QSPI_REGISTER_CALLBACKS */

      /* Get Flash information of one memory */
      (void)MT25QL512ABB_GetFlashInfo(&pInfo);

      /* set Flash Size */
      qspi_flashSize = (QSPICtx.DualFlashMode ==
                        BSP_QSPI_DUALFLASH_ENABLE) ?
                       (uint32_t)POSITION_VAL((uint32_t)pInfo.FlashSize) :
                       ((uint32_t)POSITION_VAL((uint32_t)pInfo.FlashSize) - 1U);

      /* STM32 QSPI interface initialization in dual flash mode enabled */
      if (BSP_QSPI_Configuration(&hqspi, qspi_flashSize) != BSP_ERROR_NONE)
      {
        ret = BSP_ERROR_PERIPH_FAILURE;
      }
      /* QSPI memory reset */
      else if (QSPI_ResetMemory() != BSP_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
      /* check QSPI Id check */
      else if (QSPI_CheckID() != BSP_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
      else
      {
        /* STM32 QSPI interface initialization in requested dual flash mode */
        if (BSP_QSPI_Configuration(&hqspi, qspi_flashSize) != BSP_ERROR_NONE)
        {
          ret = BSP_ERROR_PERIPH_FAILURE;
        }
        else if (MT25QL512ABB_AutoPollingMemReady(&hqspi,
                                                  convert_InterfaceMode(QSPICtx.InterfaceMode),
                                                  convert_DualFlashMode(QSPICtx.DualFlashMode)) != MT25QL512ABB_OK)
        {
          ret = BSP_ERROR_COMPONENT_FAILURE;
        }/* Force Flash enter 4 Byte address mode */
        else if (MT25QL512ABB_Enter4BytesAddressMode(&hqspi,
                                                     convert_InterfaceMode(QSPICtx.InterfaceMode)) != MT25QL512ABB_OK)
        {
          ret = BSP_ERROR_COMPONENT_FAILURE;
        }/* Configuration of the Output driver strength on memory side */
        else if (QSPI_SetODS() != BSP_ERROR_NONE)
        {
          ret = BSP_ERROR_COMPONENT_FAILURE;
        }/* Configure Flash to desired mode */
        else if (QSPI_ConfigFlash(QSPICtx.InterfaceMode, QSPICtx.TransferRate) != BSP_ERROR_NONE)
        {
          ret = BSP_ERROR_COMPONENT_FAILURE;
        }
        else
        {
          ret = BSP_ERROR_NONE;
        }
      }
#if (USE_HAL_QSPI_REGISTER_CALLBACKS == 1)
    }
#endif /* USE_HAL_QSPI_REGISTER_CALLBACKS */
  }
  else
  {
    ret = BSP_ERROR_NONE;
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  De-Initializes the QSPI interface.
  * @retval BSP status
  */
int32_t BSP_QSPI_DeInit(void)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Disable Memory mapped mode */
  if (QSPICtx.IsInitialized == BSP_QSPI_ACCESS_MMP)
  {
    if (BSP_QSPI_DisableMemoryMappedMode() != BSP_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }

  if (ret == BSP_ERROR_NONE)
  {
    /* Set default QSPICtx values */
    QSPICtx.IsInitialized = BSP_QSPI_ACCESS_NONE;
    QSPICtx.InterfaceMode = BSP_QSPI_SPI_MODE;
    QSPICtx.TransferRate  = BSP_QSPI_STR_TRANSFER;
    QSPICtx.DualFlashMode = BSP_QSPI_DUALFLASH_DISABLE;

    /* Msp QSPI deinitialization done by weak HAL_QSPI_MspDeInit function
    *  generated by STM32CubeMX tool.
    */

    /* Call the DeInit function to reset the driver */
    if (HAL_QSPI_DeInit(&hqspi) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Reads an amount of data from the QSPI memory.
  * @param  pData     Pointer to data to be read
  * @param  ReadAddr  Read start address
  * @param  Size      Size of data to read
  * @retval BSP status
  */
int32_t BSP_QSPI_Read(uint8_t *pData, uint32_t ReadAddr, uint32_t Size)
{
  int32_t ret;

  if (QSPICtx.TransferRate == BSP_QSPI_STR_TRANSFER)
  {
    if (MT25QL512ABB_ReadSTR(&hqspi, convert_InterfaceMode(QSPICtx.InterfaceMode),
                             MT25QL512ABB_4BYTES_SIZE, pData, ReadAddr, Size) != MT25QL512ABB_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      ret = BSP_ERROR_NONE;
    }
  }
  else
  {
    if (MT25QL512ABB_ReadDTR(&hqspi, convert_InterfaceMode(QSPICtx.InterfaceMode), MT25QL512ABB_4BYTES_SIZE, pData,
                             ReadAddr, Size) != MT25QL512ABB_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      ret = BSP_ERROR_NONE;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Writes an amount of data to the QSPI memory.
  * @param  pData      Pointer to data to be written
  * @param  WriteAddr  Write start address
  * @param  Size       Size of data to write
  * @retval BSP status
  */
int32_t BSP_QSPI_Write(uint8_t *pData, uint32_t WriteAddr, uint32_t Size)
{
  int32_t ret = BSP_ERROR_NONE;
  uint32_t end_addr;
  uint32_t current_size;
  uint32_t current_addr;
  uint32_t data_addr;

  /* Calculation of the size between the write address and the end of the page */
  current_size = MT25QL512ABB_PAGE_SIZE - (WriteAddr % MT25QL512ABB_PAGE_SIZE);

  /* Check if the size of the data is less than the remaining place in the page */
  if (current_size > Size)
  {
    current_size = Size;
  }

