AVSystem/Anjay-type1se/Drivers/BSP/B-L462E-CELL1/stm32l462e_cell1_qspi_onboard.c
  /* Initialize the address variables */
  current_addr = WriteAddr;
  end_addr = WriteAddr + Size;
  data_addr = (uint32_t)pData;

  /* Perform the write page by page */
  do
  {
    /* Check if Flash busy ? */
    if (MT25QL512ABB_AutoPollingMemReady(&hqspi, convert_InterfaceMode(QSPICtx.InterfaceMode),
                                         convert_DualFlashMode(QSPICtx.DualFlashMode)) != MT25QL512ABB_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }/* Enable write operations */
    else if (MT25QL512ABB_WriteEnable(&hqspi, convert_InterfaceMode(QSPICtx.InterfaceMode),
                                      convert_DualFlashMode(QSPICtx.DualFlashMode)) != MT25QL512ABB_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }/* Issue page program command */
    else if (MT25QL512ABB_PageProgram(&hqspi, convert_InterfaceMode(QSPICtx.InterfaceMode), MT25QL512ABB_4BYTES_SIZE,
                                      (uint8_t *)data_addr, current_addr, current_size) != MT25QL512ABB_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }/* Configure automatic polling mode to wait for end of program */
    else if (MT25QL512ABB_AutoPollingMemReady(&hqspi, convert_InterfaceMode(QSPICtx.InterfaceMode),
                                              convert_DualFlashMode(QSPICtx.DualFlashMode)) != MT25QL512ABB_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      /* Update the address and size variables for next page programming */
      current_addr += current_size;
      data_addr += current_size;
      current_size = ((current_addr + MT25QL512ABB_PAGE_SIZE) > end_addr) ?
                     (end_addr - current_addr) : MT25QL512ABB_PAGE_SIZE;
    }
  } while ((current_addr < end_addr) && (ret == BSP_ERROR_NONE));

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Erases the specified block of the QSPI memory.
  *         MT25QL512ABB supports 4K, 32K, 64K size block erase commands.
  * @param  BlockAddress Block address to erase
  * @param  BlockSize    Erase Block size
  * @retval BSP status
  */
int32_t BSP_QSPI_EraseBlock(uint32_t BlockAddress, BSP_QSPI_Erase_t BlockSize)
{
  int32_t ret;

  /* Check Flash busy ? */
  if (MT25QL512ABB_AutoPollingMemReady(&hqspi, convert_InterfaceMode(QSPICtx.InterfaceMode),
                                       convert_DualFlashMode(QSPICtx.DualFlashMode)) != MT25QL512ABB_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  /* Enable write operations */
  else if (MT25QL512ABB_WriteEnable(&hqspi, convert_InterfaceMode(QSPICtx.InterfaceMode),
                                    convert_DualFlashMode(QSPICtx.DualFlashMode)) != MT25QL512ABB_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  /* Issue Block Erase command */
  else if (MT25QL512ABB_BlockErase(&hqspi,
                                   convert_InterfaceMode(QSPICtx.InterfaceMode),
                                   MT25QL512ABB_4BYTES_SIZE,
                                   BlockAddress,
                                   convert_EraseBlockSize(BlockSize)) != MT25QL512ABB_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else
  {
    while (BSP_QSPI_GetStatus() == BSP_ERROR_BUSY) {}
    ret = BSP_ERROR_NONE;
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Erases the entire QSPI memory.
  * @retval BSP status
  */
int32_t BSP_QSPI_EraseChip(void)
{
  int32_t ret;

  /* Check Flash busy ? */
  if (MT25QL512ABB_AutoPollingMemReady(&hqspi, convert_InterfaceMode(QSPICtx.InterfaceMode),
                                       convert_DualFlashMode(QSPICtx.DualFlashMode)) != MT25QL512ABB_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }/* Enable write operations */
  else if (MT25QL512ABB_WriteEnable(&hqspi, convert_InterfaceMode(QSPICtx.InterfaceMode),
                                    convert_DualFlashMode(QSPICtx.DualFlashMode)) != MT25QL512ABB_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }/* Issue Chip erase command */
  else if (MT25QL512ABB_ChipErase(&hqspi, convert_InterfaceMode(QSPICtx.InterfaceMode)) != MT25QL512ABB_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else
  {
    while (BSP_QSPI_GetStatus() == BSP_ERROR_BUSY) {}
    ret = BSP_ERROR_NONE;
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Reads current status of the QSPI memory.
  *         If WIP != 0 then return busy.
  * @retval QSPI memory status: whether busy or not
  */
int32_t BSP_QSPI_GetStatus(void)
{
  uint8_t reg[2];
  int32_t ret;

  if (MT25QL512ABB_ReadStatusRegister(&hqspi, convert_InterfaceMode(QSPICtx.InterfaceMode),
                                      convert_DualFlashMode(QSPICtx.DualFlashMode), reg) != MT25QL512ABB_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }/* Check the value of the register */
  else if ((reg[0] & MT25QL512ABB_SR_WIP) != 0U)
  {
    ret = BSP_ERROR_BUSY;
  }
  else if ((QSPICtx.DualFlashMode == BSP_QSPI_DUALFLASH_ENABLE) && ((reg[1] & MT25QL512ABB_SR_WIP) != 0U))
  {
    ret = BSP_ERROR_BUSY;
  }
  else
  {
    ret = BSP_ERROR_NONE;
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Return the configuration of the QSPI memory.
  * @param  pInfo  pointer on the configuration structure
  * @retval BSP status
  */
int32_t BSP_QSPI_GetInfo(BSP_QSPI_Info_t *pInfo)
{
  int32_t ret = BSP_ERROR_NONE;
  MT25QL512ABB_Info_t pDriverInfo;

  (void)MT25QL512ABB_GetFlashInfo(&pDriverInfo);
  pInfo->FlashSize          = pDriverInfo.FlashSize;
  pInfo->EraseSectorSize    = pDriverInfo.EraseSectorSize;
  pInfo->EraseSectorsNumber = pDriverInfo.EraseSectorsNumber;
  pInfo->ProgPageSize       = pDriverInfo.ProgPageSize;
  pInfo->ProgPagesNumber    = pDriverInfo.ProgPagesNumber;

  /* Return BSP status */
  return ret;
}

/**
  * @brief  In dual flash mode disabled, Get flash ID 3 Bytes:
  *         Manufacturer ID, Memory type, Memory density
  *         In dual flash mode enabled, Get 2 set of flash ID 3 bytes:
  *         Manufacturer ID 1, Manufacturer ID 2, Memory type 1, Memory type 2,
  *         Memory density 1, Memory density 2
  * @param  Id Pointer to flash ID bytes
  * @retval BSP status
  */
int32_t BSP_QSPI_ReadID(uint8_t *Id)
{
  int32_t ret;

  if (MT25QL512ABB_ReadID(&hqspi, convert_InterfaceMode(QSPICtx.InterfaceMode), Id,
                          convert_DualFlashMode(QSPICtx.DualFlashMode)) != MT25QL512ABB_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else
  {
    ret = BSP_ERROR_NONE;
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Configure the QSPI in memory-mapped mode
  *         Only 1 Instance can running MMP mode. And it will lock system at this mode.
  * @retval BSP status
  */
int32_t BSP_QSPI_EnableMemoryMappedMode(void)
{
  int32_t ret = BSP_ERROR_NONE;

  if (QSPICtx.TransferRate == BSP_QSPI_STR_TRANSFER)
  {
    if (MT25QL512ABB_EnableMemoryMappedModeSTR(&hqspi, convert_InterfaceMode(QSPICtx.InterfaceMode),
                                               MT25QL512ABB_4BYTES_SIZE) != MT25QL512ABB_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else /* Update QSPI context if all operations are well done */
    {
      QSPICtx.IsInitialized = BSP_QSPI_ACCESS_MMP;
    }
  }
  else
  {
    if (MT25QL512ABB_EnableMemoryMappedModeDTR(&hqspi, convert_InterfaceMode(QSPICtx.InterfaceMode),
                                               MT25QL512ABB_4BYTES_SIZE) != MT25QL512ABB_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else /* Update QSPI context if all operations are well done */
    {
      QSPICtx.IsInitialized = BSP_QSPI_ACCESS_MMP;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Exit from memory-mapped mode
  *         Only 1 Instance can running MMP mode. And it will lock system at this mode.
  * @retval BSP status
  */
int32_t BSP_QSPI_DisableMemoryMappedMode(void)
{
  int32_t ret = BSP_ERROR_NONE;

  if (QSPICtx.IsInitialized != BSP_QSPI_ACCESS_MMP)
  {
    ret = BSP_ERROR_QSPI_MMP_UNLOCK_FAILURE;
  }/* Abort MMP back to indirect mode */
  else if (HAL_QSPI_Abort(&hqspi) != HAL_OK)
  {
    ret = BSP_ERROR_PERIPH_FAILURE;
  }
  else if (HAL_QSPI_Init(&hqspi) != HAL_OK)
  {
    ret = BSP_ERROR_PERIPH_FAILURE;
  }
  else /* Update QSPI context if all operations are well done */
  {
    QSPICtx.IsInitialized = BSP_QSPI_ACCESS_INDIRECT;
  }

  /* Return BSP status */
  return ret;
}

/**
  * @}
  */

/** @defgroup STM32L462E_CELL1_QSPI_ONBOARD_Private_Functions STM32L462E_CELL1 QSPI_ONBOARD Private Functions
  * @{
  */

/**
  * @brief  In dual flash mode disabled, Get flash ID 3 Bytes:
  *         Manufacturer ID, Memory type, Memory density
  *         In dual flash mode enabled, Get 2 set of flash ID 3 bytes:
  *         Manufacturer ID 1, Manufacturer ID 2, Memory type 1, Memory type 2,
  *         Memory density 1, Memory density 2
  * @param  Id Pointer to flash ID bytes
  * @retval BSP status
  */
static int32_t QSPI_CheckID(void)
{
  int32_t ret;
  uint8_t id[6] = { 0U };

  if (MT25QL512ABB_ReadID(&hqspi, convert_InterfaceMode(QSPICtx.InterfaceMode), id,
                          convert_DualFlashMode(QSPICtx.DualFlashMode)) != MT25QL512ABB_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else
  {
    /* In dual flash mode disabled, Get flash ID 3 Bytes:
    * Manufacturer ID, Memory type, Memory density
    * In dual flash mode enabled, Get 2 set of flash ID 3 bytes:
    * Manufacturer ID 1, Manufacturer ID 2, Memory type 1, Memory type 2,
    * Memory density 1, Memory density 2
    * Manufacturer ID = 20h
    * Memory type =  BAh = 3V, BBh = 1.8V
    * Memory density = 22h = 2Gb, 21h = 1Gb, 20h = 512Mb, 19h = 256Mb, 18h = 128Mb, 17h = 64Mb
    */
    if ((id[0] == 0x20U) && (id[1] == 0xBBU) && (id[2] == 0x20U))
    {
      ret = BSP_ERROR_NONE;
    }
    else
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  This function reset the QSPI Flash memory.
  *         Force QPI+DPI+SPI reset to avoid system come from unknown status.
  *         Flash accept SPI commands after reset.
  * @retval BSP status
  */
static int32_t QSPI_ResetMemory(void)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Send RESET enable command in QPI mode (QUAD I/Os, 4-0-0) */
  if (MT25QL512ABB_ResetEnable(&hqspi, MT25QL512ABB_QPI_MODE) != MT25QL512ABB_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }/* Send RESET memory command in QPI mode (QUAD I/Os, 4-0-0) */
  else if (MT25QL512ABB_ResetMemory(&hqspi, MT25QL512ABB_QPI_MODE) != MT25QL512ABB_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }/* Send RESET enable command in DPI mode (2-0-0) */
  else if (MT25QL512ABB_ResetEnable(&hqspi, MT25QL512ABB_DPI_MODE) != MT25QL512ABB_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }/* Send RESET memory command in DPI mode (2-0-0) */
  else if (MT25QL512ABB_ResetMemory(&hqspi, MT25QL512ABB_DPI_MODE) != MT25QL512ABB_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }/* Send RESET enable command in SPI mode (1-0-0) */
  else if (MT25QL512ABB_ResetEnable(&hqspi, MT25QL512ABB_SPI_MODE) != MT25QL512ABB_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }/* Send RESET memory command in SPI mode (1-0-0) */
  else if (MT25QL512ABB_ResetMemory(&hqspi, MT25QL512ABB_SPI_MODE) != MT25QL512ABB_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else
  {
    QSPICtx.IsInitialized = BSP_QSPI_ACCESS_INDIRECT;      /* After reset S/W setting to indirect access   */
    QSPICtx.InterfaceMode = BSP_QSPI_SPI_MODE;         /* After reset H/W back to SPI mode by default  */
    QSPICtx.TransferRate  = BSP_QSPI_STR_TRANSFER;     /* After reset S/W setting to STR mode          */

    /* After SWreset CMD, wait in case SWReset occurred during erase operation */
    HAL_Delay(MT25QL512ABB_RESET_MAX_TIME);
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  This function configure the Output Driver Strength on memory side.
  *         ODS bit locate in Enhanced Volatile Configuration Register[2:0]
  * @retval BSP status
  */
static int32_t QSPI_SetODS()
{
  int32_t ret;
  uint8_t reg[2];  /** reg[0] contains reg value for FLASHID_1,
                    * reg[1] contains reg value for FLASHID_2 in case of dual flash mode
                    */

  if (MT25QL512ABB_ReadEnhancedVolCfgRegister(&hqspi, convert_InterfaceMode(QSPICtx.InterfaceMode),
                                              convert_DualFlashMode(QSPICtx.DualFlashMode), reg) != MT25QL512ABB_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else
  {
    /* Set Output Strength of the QSPI memory as CONF_QSPI_ODS variable ohms */
    MODIFY_REG(reg[0], MT25QL512ABB_EVCR_ODS,
               (((uint8_t)CONF_QSPI_ODS) << (POSITION_VAL(MT25QL512ABB_EVCR_ODS) & 0x7U)));
    MODIFY_REG(reg[1], MT25QL512ABB_EVCR_ODS,
               (((uint8_t)CONF_QSPI_ODS) << (POSITION_VAL(MT25QL512ABB_EVCR_ODS) & 0x7U)));

    /* Enable write operations */
    if (MT25QL512ABB_WriteEnable(&hqspi, convert_InterfaceMode(QSPICtx.InterfaceMode),
                                 convert_DualFlashMode(QSPICtx.DualFlashMode)) != MT25QL512ABB_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }/* Issue Write command */
    else if (MT25QL512ABB_WriteEnhancedVolCfgRegister(&hqspi, convert_InterfaceMode(QSPICtx.InterfaceMode),
                                                      convert_DualFlashMode(QSPICtx.DualFlashMode),
                                                      reg) != MT25QL512ABB_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }/* Configure automatic polling mode to wait for end of program */
    else if (MT25QL512ABB_AutoPollingMemReady(&hqspi, convert_InterfaceMode(QSPICtx.InterfaceMode),
                                              convert_DualFlashMode(QSPICtx.DualFlashMode)) != MT25QL512ABB_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      ret = BSP_ERROR_NONE;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  This function put QSPI memory in DPI mode (Dual I/O) from SPI mode.
  * @retval BSP status
  */
static int32_t QSPI_EnterDPIMode(void)
{
  int32_t ret;
  uint8_t reg[2];  /* reg[0] contains reg value for FLASHID_1,
                      reg[1] contains reg value for FLASHID_2 in case of dual flash mode */

  if (MT25QL512ABB_ReadEnhancedVolCfgRegister(&hqspi, convert_InterfaceMode(QSPICtx.InterfaceMode),
                                              convert_DualFlashMode(QSPICtx.DualFlashMode), reg) != MT25QL512ABB_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else
  {
    /* Set Dual I/O protocol */
    CLEAR_BIT(reg[0], MT25QL512ABB_EVCR_DPI);
    CLEAR_BIT(reg[1], MT25QL512ABB_EVCR_DPI);

    /* Enable write operations */
    if (MT25QL512ABB_WriteEnable(&hqspi, convert_InterfaceMode(QSPICtx.InterfaceMode),
                                 convert_DualFlashMode(QSPICtx.DualFlashMode)) != MT25QL512ABB_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }/* Issue Write command */
    else if (MT25QL512ABB_WriteEnhancedVolCfgRegister(&hqspi, convert_InterfaceMode(QSPICtx.InterfaceMode),
                                                      convert_DualFlashMode(QSPICtx.DualFlashMode),
                                                      reg) != MT25QL512ABB_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }/* Configure automatic polling mode to wait for end of program */
    else if (MT25QL512ABB_AutoPollingMemReady(&hqspi, MT25QL512ABB_DPI_MODE,
                                              convert_DualFlashMode(QSPICtx.DualFlashMode)) != MT25QL512ABB_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      ret = BSP_ERROR_NONE;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  This function put QSPI memory in SPI mode from DPI mode (Dual I/O).
  * @retval BSP status
  */
static int32_t QSPI_ExitDPIMode(void)
{
  int32_t ret;
  uint8_t reg[2];  /** reg[0] contains reg value for FLASHID_1,
                    * reg[1] contains reg value for FLASHID_2 in case of dual flash mode
                    */

  if (MT25QL512ABB_ReadEnhancedVolCfgRegister(&hqspi, MT25QL512ABB_DPI_MODE,
                                              convert_DualFlashMode(QSPICtx.DualFlashMode),
                                              reg) != MT25QL512ABB_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else
  {
    /* Disable Dual I/O protocol */
    SET_BIT(reg[0], MT25QL512ABB_EVCR_DPI);
    SET_BIT(reg[1], MT25QL512ABB_EVCR_DPI);

    /* Enable write operations */
    if (MT25QL512ABB_WriteEnable(&hqspi, MT25QL512ABB_DPI_MODE,
                                 convert_DualFlashMode(QSPICtx.DualFlashMode)) != MT25QL512ABB_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }/* Issue Write command */
    else if (MT25QL512ABB_WriteEnhancedVolCfgRegister(&hqspi, MT25QL512ABB_DPI_MODE,
                                                      convert_DualFlashMode(QSPICtx.DualFlashMode),
                                                      reg) != MT25QL512ABB_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }/* Configure automatic polling mode to wait for end of program */
    else if (MT25QL512ABB_AutoPollingMemReady(&hqspi, convert_InterfaceMode(QSPICtx.InterfaceMode),
                                              convert_DualFlashMode(QSPICtx.DualFlashMode)) != MT25QL512ABB_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      ret = BSP_ERROR_NONE;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Set Flash to desired Interface mode. And this instance becomes current instance.
  *         If current instance running at MMP mode then this function doesn't work.
  *         Indirect -> Indirect
  * @param  Mode      QSPI mode
  * @param  Rate      QSPI transfer rate
  * @retval BSP status
  */
static int32_t QSPI_ConfigFlash(BSP_QSPI_Interface_t Mode, BSP_QSPI_Transfer_t Rate)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if MMP mode locked ************************************************/
  if (QSPICtx.IsInitialized == BSP_QSPI_ACCESS_MMP)
  {
    ret = BSP_ERROR_QSPI_MMP_LOCK_FAILURE;
  }
  else
  {
    /* Setup Flash interface ***************************************************/
    switch (QSPICtx.InterfaceMode)
    {
      case BSP_QSPI_QPI_MODE :               /* 4-4-4 commands */
        if (Mode != BSP_QSPI_QPI_MODE)
        {
          /* Exit Quad I/O protocol mode */
          if (MT25QL512ABB_ExitQPIMode(&hqspi) != MT25QL512ABB_OK)
          {
            ret = BSP_ERROR_COMPONENT_FAILURE;
          }
          else if (Mode == BSP_QSPI_DPI_MODE)
          {
            /* Enter Dual I/O protocol mode */
            ret = QSPI_EnterDPIMode();
          }
          else
          {
            /* Nothing to do */
          }
        }
        break;

      case BSP_QSPI_DPI_MODE :               /* 2-2-2 commands */
        if (Mode != BSP_QSPI_DPI_MODE)
        {
          /* Exit Dual I/O protocol mode */
          if (QSPI_ExitDPIMode() != BSP_ERROR_NONE)
          {
            ret = BSP_ERROR_COMPONENT_FAILURE;
          }
          else if (Mode == BSP_QSPI_QPI_MODE)
          {
            /* Enter Quad I/O protocol mode */
            if (MT25QL512ABB_EnterQPIMode(&hqspi) != MT25QL512ABB_OK)
            {
              ret = BSP_ERROR_COMPONENT_FAILURE;
            }
          }
          else
          {
            /* Nothing to do */
          }
        }
        break;

      case BSP_QSPI_SPI_MODE :               /* 1-1-1 commands, Power on H/W default setting */
      case BSP_QSPI_SPI_1I2O_MODE :          /* 1-1-2 commands */
      case BSP_QSPI_SPI_2IO_MODE :           /* 1-2-2 commands */
      case BSP_QSPI_SPI_1I4O_MODE :          /* 1-1-4 commands */
      case BSP_QSPI_SPI_4IO_MODE :           /* 1-4-4 commands */
      default :
        if (Mode == BSP_QSPI_QPI_MODE)
        {
          /* Enter Quad I/O protocol mode */
          if (MT25QL512ABB_EnterQPIMode(&hqspi) != MT25QL512ABB_OK)
          {
            ret = BSP_ERROR_COMPONENT_FAILURE;
          }
        }
        else if (Mode == BSP_QSPI_DPI_MODE)
        {
          /* Enter Dual I/O protocol mode */
          ret = QSPI_EnterDPIMode();
        }
        else
        {
          /* Nothing to do */
        }
        break;
    }

    /* Update QSPI context if all operations are well done */
    if (ret == BSP_ERROR_NONE)
    {
      /* Update current status parameter *****************************************/
      QSPICtx.IsInitialized = BSP_QSPI_ACCESS_INDIRECT;
      QSPICtx.InterfaceMode = Mode;
      QSPICtx.TransferRate  = Rate;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Convert BSP interface mode to MT25QL512ABB driver interface mode
  * @param  inMode  BSP QSPI interface mode
  * @retval converted interface mode value for MT25QL512ABB driver
  */
static MT25QL512ABB_Interface_t convert_InterfaceMode(BSP_QSPI_Interface_t inMode)
{
  MT25QL512ABB_Interface_t outMode;

