AVSystem/Anjay-type1se/Drivers/BSP/B-L462E-CELL1/stm32l462e_cell1_qspi_onboard.c
  if (inMode == BSP_QSPI_QPI_MODE)
  {
    outMode = MT25QL512ABB_QPI_MODE;
  }
  else if (inMode == BSP_QSPI_DPI_MODE)
  {
    outMode = MT25QL512ABB_DPI_MODE;
  }
  else if (inMode == BSP_QSPI_SPI_4IO_MODE)
  {
    outMode = MT25QL512ABB_SPI_4IO_MODE;
  }
  else if (inMode == BSP_QSPI_SPI_1I4O_MODE)
  {
    outMode = MT25QL512ABB_SPI_1I4O_MODE;
  }
  else if (inMode == BSP_QSPI_SPI_2IO_MODE)
  {
    outMode = MT25QL512ABB_SPI_2IO_MODE;
  }
  else if (inMode == BSP_QSPI_SPI_1I2O_MODE)
  {
    outMode = MT25QL512ABB_SPI_1I2O_MODE;
  }
  else
  {
    outMode = MT25QL512ABB_SPI_MODE;
  }

  return (outMode);
}

/**
  * @brief  Convert BSP DualFlash mode to MT25QL512ABB driver DualFlash mode
  * @param  inMode  BSP QSPI DualFlash mode
  * @retval converted DualFlash mode value for MT25QL512ABB driver
  */
static MT25QL512ABB_DualFlash_t convert_DualFlashMode(BSP_QSPI_DualFlash_t inMode)
{
  MT25QL512ABB_DualFlash_t outMode;

  if (inMode == BSP_QSPI_DUALFLASH_ENABLE)
  {
    outMode = MT25QL512ABB_DUALFLASH_ENABLE;
  }
  else
  {
    outMode = MT25QL512ABB_DUALFLASH_DISABLE;
  }

  return (outMode);
}

/**
  * @brief  Convert BSP Erase mode to MT25QL512ABB driver Erase mode
  * @param  inMode  BSP QSPI Erase mode
  * @retval converted Erase mode value for MT25QL512ABB driver
  */
static MT25QL512ABB_Erase_t convert_EraseBlockSize(BSP_QSPI_Erase_t inSize)
{
  MT25QL512ABB_Erase_t outSize;

  if (inSize == BSP_QSPI_ERASE_CHIP)
  {
    outSize = MT25QL512ABB_ERASE_BULK;
  }
  else if (inSize == BSP_QSPI_ERASE_64K)
  {
    outSize = MT25QL512ABB_ERASE_64K;
  }
  else if (inSize == BSP_QSPI_ERASE_32K)
  {
    outSize = MT25QL512ABB_ERASE_32K;
  }
  else
  {
    outSize = MT25QL512ABB_ERASE_4K;
  }

  return (outSize);
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

